-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 12, 2020 at 04:30 PM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `projecti`
--

-- --------------------------------------------------------

--
-- Table structure for table `document`
--

CREATE TABLE `document` (
  `doc_id` int(5) NOT NULL,
  `document_id` varchar(50) NOT NULL,
  `date_cre` date NOT NULL,
  `from_doc` varchar(100) NOT NULL,
  `reciever` varchar(100) NOT NULL,
  `title_doc` varchar(100) NOT NULL,
  `text_doc` varchar(255) NOT NULL,
  `action_doc` varchar(100) NOT NULL,
  `notation` varchar(200) NOT NULL,
  `path_doc` varchar(200) NOT NULL,
  `status_doc` varchar(200) NOT NULL,
  `urgency_doc` varchar(200) NOT NULL,
  `type_doc` varchar(200) NOT NULL,
  `About` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `document`
--

INSERT INTO `document` (`doc_id`, `document_id`, `date_cre`, `from_doc`, `reciever`, `title_doc`, `text_doc`, `action_doc`, `notation`, `path_doc`, `status_doc`, `urgency_doc`, `type_doc`, `About`) VALUES
(399, 'ฝว.31/2563', '2020-04-03', 'งานประกันคุณภาพการศึกษา', ' ชุติกาญจน์ แก่นเพ็ชร', 'ขอจัดส่งข้อมูลเพื่อกานประกันคุณภาพการศึกษาภายในประจำปีการศึกษา 2562', 'ขอรายละเอียดข้อมูลการประกันคุณภาพ', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'เปิดอ่านแล้ว', 'ปกติ', 'เอกสารรับ', 'เกี่ยวข้องกับSAR'),
(400, 'อว. 0649.15/1132', '2020-04-01', 'ฝ่ายมาตราฐานการศึกษา', 'คณบดี', 'ติดตามการดำเนินการบันทึกข้อมูล มคอ. 7 ในระบบ TQF', '', 'ตอบกลับ', 'มอบ ดร.ศิริชัย ดำเนินการ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(401, 'อว. 0649.15/1129', '2020-03-31', 'ฝ่ายมาตราฐานการศึกษา', 'คณบดี', 'การดำเนินการบันทึกข้อมูล คอ.5/6 ในระบบโปรแกรม TQF ภาคการศึกษา 2/2562', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', 'ทดสอบแนบไฟล์.pdf', 'เปิดอ่านแล้ว', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(402, 'อว. 0649.30/1', '2020-03-31', 'สำนักงานประกันคุณภาพ', 'คณบดี', 'ขอเลื่อนจัดการโครงการอบรมหลักสูตรผู้ประเมินคุณภาพการศึกษาภายใน ระดับหลักสูตร และระดับคณะฯ', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'เกี่ยวข้องกับSAR'),
(403, 'อว. 0649.16/311', '2020-04-07', 'กองกลาง', 'ผู้บริหาร', 'ขอส่งประกาศศูนย์ป้องกันภัยและควบคุมโรคติดต่อเชื้อไวรัส COVID-19 ภายในมหาวิทยาลัยฯ', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'เปิดอ่านแล้ว', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(404, 'ฝว. 34', '2020-04-06', 'งานทะเบียนวัดผล', 'ผู้บริหาร', 'ขอแผนการสอนและวิธีการวัดผล สำหรับรายวิชาที่เปิดภาคฤดูร้อนปี 2563', '', 'ตอบกลับ', 'แจ้งอาจารย์', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ด่วน', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(405, 'วศ.53/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', 'ผูหน่วยงาน', 'การปฎิบัติงานช่วงการฉีดพ่นยายาฆ่าเชื้อไวรัสโคโรน่า2019', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'เปิดอ่านแล้ว', 'ด่วน', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(406, 'อว. 0649.32/562', '2020-02-25', 'กองอาคารสถานที่', 'หน่วยงาน', 'ขอแจ้งการฉัดพ่นยาฆ่าเชื้อ', '', 'ไม่ตอบกลับ', 'แจ้งเจ้าหน้าที่', 'ทดสอบแนบไฟล์.pdf', 'เปิดอ่านแล้ว', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(407, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', ' ชุติกาญจน์ แก่นเพ็ชร', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(408, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(409, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(410, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(411, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(412, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(413, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(414, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(415, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(416, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(417, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(418, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(419, 'งทบ 015/63', '2020-03-23', 'มาโนช ประชา', 'งานทะเบียนวัดผล', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา ภาควิชาวิศวกรรมคอมพิวเตอร์', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'เปิดอ่านแล้ว', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(420, 'คพ 36/63', '2020-03-23', 'ชุติกาญจน์ แก่นเพ็ชร', 'ทุกคน', 'แนวทางปฏิบัติสำหรับนักศึกษาออกฝึกประสบการณ์วิชาชีพ', '', 'ตอบกลับ', 'แจ้งเจ้าหน้าที่ประสานงานสหกิจ', '', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(421, 'วศ.48/63', '2020-03-23', 'มาโนช ประชา', 'ทุกคน', 'ขอเชิญประชุม', '', 'ไม่ตอบกลับ', 'ทราบ', '', 'เปิดอ่านแล้ว', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(422, 'ฝว. 24', '2020-03-14', 'สุทินัน พรอนุรักษ์', 'ทุกคน', 'ขอส่งใบงานการปฏิบัติงาน', '', 'ตอบกลับ', '-', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(423, 'วศ.51/63', '2020-04-02', ' ชุติกาญจน์ แก่นเพ็ชร', 'คณะวิศวกรรมศาสตร์', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ไม่ตอบกลับ', '-', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(424, 'ฝว. 34', '2020-04-06', 'มาโนช ประชา', 'งานทะเบียนวัดผล', 'ขอแผนการสอนและวิธีการวัดผล สำหรับรายวิชาที่เปิดภาคฤดูร้อนปี 2563', '', 'ตอบกลับ', 'แจ้งอาจารย์', 'ทดสอบแนบไฟล์.pdf', 'เปิดอ่านแล้ว', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(425, 'ฝว.31/2563', '2020-04-03', ' ชุติกาญจน์ แก่นเพ็ชร', 'งานประกันคุณภาพ', 'ขอจัดส่งข้อมูลเพื่อกานประกันคุณภาพการศึกษาภายในประจำปีการศึกษา 2562', '', 'ไม่ตอบกลับ', '-', 'ทดสอบแนบไฟล์.pdf', 'เปิดอ่านแล้ว', 'ปกติ', 'เอกสารส่ง', 'เกี่ยวข้องกับSAR'),
(426, 'อว. 0649.30/1', '2020-04-06', 'มาโนช ประชา', 'สำนักงานประกันคุณภาพ', 'ขอเลื่อนจัดการโครงการอบรมหลักสูตรสำนักงานประกันคุณภาพภายใน ระดับหลักสูตร และระดับคณะฯ', '', 'ตอบกลับ', 'แจ้งสำนักงานประกันคุณภาพ', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'เกี่ยวข้องกับSAR'),
(427, 'อว. 0649.15/1129', '2020-03-31', 'มาโนข ประชา', 'ฝ่ายมาตราฐานการศึกษา', 'การดำเนินการบันทึกข้อมูล คอ.5/6 ในระบบโปรแกรม TQF ภาคการศึกษา 2/2562', '', 'ไม่ตอบกลับ', '-', 'ทดสอบแนบไฟล์.pdf', 'เปิดอ่านแล้ว', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(428, 'อว. 0649.16/311', '2020-04-15', 'มาโนช ประชา', 'ทุกคน', 'ขอส่งประกาศศูนย์ป้องกันภัยและควบคุมโรคติดต่อเชื้อไวรัส COVID-19 ภายในมหาวิทยาลัยฯ', '', 'ไม่ตอบกลับ', 'แจ้งกองกลาง', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(429, 'งทบ 015/63', '2020-03-23', 'มาโนช ประชา', 'งานทะเบียนวัดผล', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', '', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(430, 'งทบ 015/63', '2020-03-23', 'มาโนช ประชา', 'งานทะเบียนวัดผล', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', '', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(431, 'งทบ 015/68', '2020-03-23', 'มาโนช ประชา', 'ทุกคน', 'ขอส่งประกาศศูนย์ป้องกันภัยและควบคุมโรคติดต่อเชื้อไวรัส COVID-19 ภายในมหาวิทยาลัยฯ', '', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(432, 'งทบ 015/63', '2020-03-23', 'มาโนช ประชา', 'ทุกคน', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', '', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(433, 'งทบ 015/63', '2020-03-23', 'มาโนช ประชา', 'งานทะเบียนวัดผล', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', '', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR');

-- --------------------------------------------------------

--
-- Table structure for table `notification`
--

CREATE TABLE `notification` (
  `id` int(11) NOT NULL,
  `token` varchar(200) NOT NULL,
  `token2` varchar(250) NOT NULL,
  `text` varchar(300) NOT NULL,
  `status` varchar(11) NOT NULL,
  `type` varchar(200) NOT NULL,
  `time` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `notification`
--

INSERT INTO `notification` (`id`, `token`, `token2`, `text`, `status`, `type`, `time`) VALUES
(39, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-06'),
(40, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-06'),
(41, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-06'),
(42, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารSAR', '2020-06-06'),
(45, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-06'),
(46, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-06'),
(47, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-08'),
(48, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-08'),
(49, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-08'),
(50, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-09'),
(51, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-09'),
(52, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-09'),
(53, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-09'),
(54, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-09'),
(55, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-09'),
(56, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-09'),
(70, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-10'),
(78, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-10'),
(79, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-10'),
(82, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-10'),
(83, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-10'),
(84, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-10'),
(85, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารSAR', '2020-06-10'),
(89, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-11'),
(90, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-11'),
(98, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-11'),
(100, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-11'),
(129, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-11'),
(130, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารSAR', '2020-06-11'),
(131, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-11'),
(132, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-11'),
(133, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-11'),
(134, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารSAR', '2020-06-11'),
(139, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-11'),
(141, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-11'),
(142, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(143, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(144, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(145, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(146, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(147, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(148, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(149, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(150, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(151, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(152, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(153, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(154, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(155, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(156, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(157, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(158, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(159, '1', 'user2', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(160, '1', 'user2', 'มีเอกสารใหม่เข้า', 'unread', 'เอกสารส่ง', '2020-06-12'),
(161, '1', 'user2', 'มีเอกสารใหม่เข้า', 'unread', 'เอกสารส่ง', '2020-06-12'),
(162, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(163, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(164, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(165, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(166, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(167, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(168, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(169, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(170, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(171, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารรับ', '2020-06-12'),
(172, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12'),
(173, '2', 'user3', 'มีเอกสารใหม่เข้า', 'read', 'เอกสารส่ง', '2020-06-12');

-- --------------------------------------------------------

--
-- Table structure for table `savedocument`
--

CREATE TABLE `savedocument` (
  `doc_id` int(5) NOT NULL,
  `document_id` varchar(50) NOT NULL,
  `date_cre` date NOT NULL,
  `from_doc` varchar(100) NOT NULL,
  `reciever` varchar(100) NOT NULL,
  `title_doc` varchar(100) NOT NULL,
  `text_doc` varchar(100) NOT NULL,
  `action_doc` varchar(100) NOT NULL,
  `notation` varchar(200) NOT NULL,
  `path_doc` varchar(200) NOT NULL,
  `status_doc` varchar(200) NOT NULL,
  `urgency_doc` varchar(200) NOT NULL,
  `type_doc` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `savedocument`
--

INSERT INTO `savedocument` (`doc_id`, `document_id`, `date_cre`, `from_doc`, `reciever`, `title_doc`, `text_doc`, `action_doc`, `notation`, `path_doc`, `status_doc`, `urgency_doc`, `type_doc`) VALUES
(52, 'กพ. 2', '2020-06-10', 'สุทินัน พรอนุรักษ์', ' มาโนช  ประชา ', 'ข้อกำหนดในการเรียนวิชาสหกิจศึกษาและวิชาฝึกงาน  ', ' สำหรับนักศึกษาภาควิชาวิศวกรรมคอมพิวเตอร์  มหาวิทยาลัยเทคโนโลยีราชมงคลธัญบุรี', 'ไม่ตอบกลับ', '-', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'บันทึกข้อความ'),
(53, 'ฝว. 34', '2020-06-10', 'สุทินัน พรอนุรักษ์', 'งานทะเบียนวัดผล', 'ขอแผนการสอนและวิธีการวัดผล สำหรับรายวิชาที่เปิดภาคฤดูร้อนปี 2563', 'ขอแผนการสอนและวิธีการวัดผล สำหรับรายวิชาที่เปิดภาคฤดูร้อนปี 2563', 'ไม่ตอบกลับ', '-', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'บันทึกข้อความ'),
(54, 'ฝว. 34', '2020-05-19', 'สุทินัน พรอนุรักษ์', 'มาโนช ประชา', 'ขอส่งใบงานการปฏิบัติงาน', '', 'ไม่ตอบกลับ', '-', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'บันทึกข้อความ'),
(55, 'งทบ 015/63', '2020-05-04', 'สุทินัน พรอนุรักษ์', 'งานทะเบียนวัดผล', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', '', 'ไม่ตอบกลับ', '-', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'บันทึกข้อความ');

-- --------------------------------------------------------

--
-- Table structure for table `savesdocument`
--

CREATE TABLE `savesdocument` (
  `doc_id` int(5) NOT NULL,
  `document_id` varchar(50) NOT NULL,
  `date_cre` date NOT NULL,
  `from_doc` varchar(100) NOT NULL,
  `reciever` varchar(100) NOT NULL,
  `title_doc` varchar(100) NOT NULL,
  `text_doc` varchar(100) NOT NULL,
  `action_doc` varchar(100) NOT NULL,
  `notation` varchar(200) NOT NULL,
  `path_doc` varchar(200) NOT NULL,
  `status_doc` varchar(200) NOT NULL,
  `urgency_doc` varchar(200) NOT NULL,
  `type_doc` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `savesuperdocument`
--

CREATE TABLE `savesuperdocument` (
  `doc_id` int(5) NOT NULL,
  `document_id` varchar(50) NOT NULL,
  `date_cre` date NOT NULL,
  `from_doc` varchar(100) NOT NULL,
  `reciever` varchar(100) NOT NULL,
  `title_doc` varchar(100) NOT NULL,
  `text_doc` varchar(100) NOT NULL,
  `action_doc` varchar(100) NOT NULL,
  `notation` varchar(200) NOT NULL,
  `path_doc` varchar(200) NOT NULL,
  `status_doc` varchar(200) NOT NULL,
  `urgency_doc` varchar(200) NOT NULL,
  `type_doc` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `savesuperdocument`
--

INSERT INTO `savesuperdocument` (`doc_id`, `document_id`, `date_cre`, `from_doc`, `reciever`, `title_doc`, `text_doc`, `action_doc`, `notation`, `path_doc`, `status_doc`, `urgency_doc`, `type_doc`) VALUES
(1, '1', '2020-05-26', 'ปอน', 'แฮท', 'บันทึกข้อความ', 'ใส่ข้อความมมมมมมมมมม', '', 'ไม่มี', '', '', 'บันทึกข้อความ', 'บันทึกข้อความ'),
(46, 'สค. 11', '2020-05-28', 'มาโนช ประชา', ' ชุติกาญจน์ แก่นเพ็ชร ', 'dfdf', 'fggggggggggggggggggggggggggggggggggggggggggggggggg', 'ตอบกลับ', 'ปอน', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'บันทึกข้อความ');

-- --------------------------------------------------------

--
-- Table structure for table `superdocument`
--

CREATE TABLE `superdocument` (
  `doc_id` int(5) NOT NULL,
  `document_id` varchar(50) NOT NULL,
  `date_cre` date NOT NULL,
  `from_doc` varchar(100) NOT NULL,
  `reciever` varchar(100) NOT NULL,
  `title_doc` varchar(100) NOT NULL,
  `text_doc` varchar(255) NOT NULL,
  `action_doc` varchar(100) NOT NULL,
  `notation` varchar(200) NOT NULL,
  `path_doc` varchar(200) NOT NULL,
  `status_doc` varchar(200) NOT NULL,
  `urgency_doc` varchar(200) NOT NULL,
  `type_doc` varchar(200) NOT NULL,
  `About` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `superdocument`
--

INSERT INTO `superdocument` (`doc_id`, `document_id`, `date_cre`, `from_doc`, `reciever`, `title_doc`, `text_doc`, `action_doc`, `notation`, `path_doc`, `status_doc`, `urgency_doc`, `type_doc`, `About`) VALUES
(399, 'ฝว.31/2563', '2020-04-03', 'งานประกันคุณภาพการศึกษา', 'ทุกคน', 'ขอจัดส่งข้อมูลเพื่อกานประกันคุณภาพการศึกษาภายในประจำปีการศึกษา 2562', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'เกี่ยวข้องกับSAR'),
(400, 'อว. 0649.15/1132', '2020-04-01', 'ฝ่ายมาตราฐานการศึกษา', 'ทุกคน', 'ติดตามการดำเนินการบันทึกข้อมูล มคอ. 7 ในระบบ TQF', '', 'ตอบกลับ', 'มอบ ดร.ศิริชัย ดำเนินการ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(401, 'อว. 0649.15/1129', '2020-03-31', 'ฝ่ายมาตราฐานการศึกษา', 'คณบดี', 'การดำเนินการบันทึกข้อมูล คอ.5/6 ในระบบโปรแกรม TQF ภาคการศึกษา 2/2562', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(402, 'อว. 0649.30/1', '2020-03-31', 'สำนักงานประกันคุณภาพ', 'ทุกคน', 'ขอเลื่อนจัดการโครงการอบรมหลักสูตรผู้ประเมินคุณภาพการศึกษาภายใน ระดับหลักสูตร และระดับคณะฯ', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'เกี่ยวข้องกับSAR'),
(403, 'อว. 0649.16/311', '2020-04-07', 'กองกลาง', 'ผู้บริหาร', 'ขอส่งประกาศศูนย์ป้องกันภัยและควบคุมโรคติดต่อเชื้อไวรัส COVID-19 ภายในมหาวิทยาลัยฯ', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(404, 'ฝว. 34', '2020-04-06', 'งานทะเบียนวัดผล', 'ผู้บริหาร', 'ขอแผนการสอนและวิธีการวัดผล สำหรับรายวิชาที่เปิดภาคฤดูร้อนปี 2563', '', 'ตอบกลับ', 'แจ้งอาจารย์', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ด่วน', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(405, 'วศ.53/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', 'ทุกคน', 'การปฎิบัติงานช่วงการฉีดพ่นยายาฆ่าเชื้อไวรัสโคโรน่า2019', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ด่วน', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(406, 'อว. 0649.32/562', '2020-02-25', 'กองอาคารสถานที่', 'หน่วยงาน', 'ขอแจ้งการฉัดพ่นยาฆ่าเชื้อ', '', 'ไม่ตอบกลับ', 'แจ้งเจ้าหน้าที่', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(407, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', ' ชุติกาญจน์ แก่นเพ็ชร', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(408, 'วศ.51/63', '2020-04-02', 'คณะวิศวกรรมศาสตร์', '', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวข้องกับSAR'),
(419, 'งทบ 015/63', '2020-03-23', 'มาโนช ประชา', 'ทุกคน', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', '', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(420, 'คพ 36/63', '2020-03-23', 'ชุติกาญจน์ แก่นเพ็ชร', 'สหกิจศึกษา', 'แนวทางปฏิบัติสำหรับนักศึกษาออกฝึกประสบการณ์วิชาชีพ', '', 'ตอบกลับ', 'แจ้งเจ้าหน้าที่ประสานงานสหกิจ', '', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(421, 'วศ.48/63', '2020-03-23', 'มาโนช ประชา', 'ทุกคน', 'ขอเชิญประชุม', '', 'ไม่ตอบกลับ', 'ทราบ', '', 'ยังไม่เปืดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(422, 'ฝว. 24', '2020-03-14', 'สุทินัน พรอนุรักษ์', 'ทุกคน', 'ขอส่งใบงานการปฏิบัติงาน', '', 'ตอบกลับ', '-', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(423, 'วศ.51/63', '2020-04-02', ' ชุติกาญจน์ แก่นเพ็ชร', 'คณะวิศวกรรมศาสตร์', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ไม่ตอบกลับ', '-', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(424, 'ฝว. 34', '2020-04-06', 'มาโนช ประชา', 'งานทะเบียนวัดผล', 'ขอแผนการสอนและวิธีการวัดผล สำหรับรายวิชาที่เปิดภาคฤดูร้อนปี 2563', '', 'ตอบกลับ', 'แจ้งอาจารย์', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(425, 'ฝว.31/2563', '2020-04-03', ' ชุติกาญจน์ แก่นเพ็ชร', 'งานประกันคุณภาพ', 'ขอจัดส่งข้อมูลเพื่อกานประกันคุณภาพการศึกษาภายในประจำปีการศึกษา 2562', '', 'ไม่ตอบกลับ', '-', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'เกี่ยวข้องกับSAR'),
(426, 'อว. 0649.30/1', '2020-04-06', 'มาโนช ประชา', 'สำนักงานประกันคุณภาพ', 'ขอเลื่อนจัดการโครงการอบรมหลักสูตรสำนักงานประกันคุณภาพภายใน ระดับหลักสูตร และระดับคณะฯ', '', 'ตอบกลับ', 'แจ้งสำนักงานประกันคุณภาพ', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'เกี่ยวข้องกับSAR'),
(427, 'อว. 0649.15/1129', '2020-03-31', 'มาโนข ประชา', 'ฝ่ายมาตราฐานการศึกษา', 'การดำเนินการบันทึกข้อมูล คอ.5/6 ในระบบโปรแกรม TQF ภาคการศึกษา 2/2562', '', 'ไม่ตอบกลับ', '-', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR'),
(428, 'อว. 0649.16/311', '2020-04-15', 'มาโนช ประชา', 'กองกลาง', 'ขอส่งประกาศศูนย์ป้องกันภัยและควบคุมโรคติดต่อเชื้อไวรัส COVID-19 ภายในมหาวิทยาลัยฯ', '', 'ไม่ตอบกลับ', 'แจ้งกองกลาง', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวข้องกับSAR');

-- --------------------------------------------------------

--
-- Table structure for table `userdocument`
--

CREATE TABLE `userdocument` (
  `doc_id` int(5) NOT NULL,
  `document_id` varchar(50) NOT NULL,
  `date_cre` date NOT NULL,
  `from_doc` varchar(100) NOT NULL,
  `reciever` varchar(100) NOT NULL,
  `title_doc` varchar(100) NOT NULL,
  `text_doc` varchar(255) NOT NULL,
  `action_doc` varchar(100) NOT NULL,
  `notation` varchar(200) NOT NULL,
  `path_doc` varchar(200) NOT NULL,
  `status_doc` varchar(200) NOT NULL,
  `urgency_doc` varchar(200) NOT NULL,
  `type_doc` varchar(200) NOT NULL,
  `About` varchar(255) NOT NULL,
  `dateend` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `userdocument`
--

INSERT INTO `userdocument` (`doc_id`, `document_id`, `date_cre`, `from_doc`, `reciever`, `title_doc`, `text_doc`, `action_doc`, `notation`, `path_doc`, `status_doc`, `urgency_doc`, `type_doc`, `About`, `dateend`) VALUES
(399, 'ฝว.31/2563', '2020-04-03', 'งานประกันคุณภาพการศึกษา', 'ทุกคน', 'ขอจัดส่งข้อมูลเพื่อกานประกันคุณภาพการศึกษาภายในประจำปีการศึกษา 2562', '', 'ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'เกี่ยวกับSAR', '2020-06-12'),
(402, 'อว. 0649.30/1', '2020-03-31', 'ฝ่ายมาตราฐานการศึกษา\r\n', 'สุทินัน พรอนุรักษ์', 'ขอเลื่อนจัดการโครงการอบรมหลักสูตรผู้ประเมินคุณภาพการศึกษาภายใน ระดับหลักสูตร และระดับคณะฯ', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'เกี่ยวกับSAR', '2020-06-12'),
(403, 'อว. 0649.16/311', '2020-04-07', 'ฝ่ายมาตราฐานการศึกษา\r\n', 'ทุกคน', 'ขอส่งประกาศศูนย์ป้องกันภัยและควบคุมโรคติดต่อเชื้อไวรัส COVID-19 ภายในมหาวิทยาลัยฯ', '', 'ล่าช้า', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารรับ', 'ไม่เกี่ยวกับSAR', '2020-06-12'),
(404, 'ฝว. 34', '2020-04-06', 'สำนักงานประกันคุณภาพ\r\n', 'สุทินัน พรอนุรักษ์', 'ขอแผนการสอนและวิธีการวัดผล สำหรับรายวิชาที่เปิดภาคฤดูร้อนปี 2563', '', 'ตอบกลับ', 'แจ้งอาจารย์', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ด่วน', 'เอกสารรับ', 'ไม่เกี่ยวกับSAR', '2020-06-12'),
(405, 'วศ.53/63', '2020-04-02', 'กองกลาง\r\n', 'ทุกคน', 'การปฎิบัติงานช่วงการฉีดพ่นยายาฆ่าเชื้อไวรัสโคโรน่า2019', '', 'ไม่ตอบกลับ', 'แจ้งอาจารย์และเจ้าหน้าที่', '', 'ยังไม่เปิดอ่าน', 'ด่วน', 'เอกสารรับ', 'ไม่เกี่ยวกับSAR', '2020-06-12'),
(419, 'งทบ 015/63', '2020-03-23', 'งานทะเบียนวัดผล\r\n', 'สุทินัน พรอนุรักษ์', 'ขอคำสั่งแต่งตั้งอาจารย์ที่ปรึกษา นักศึกษาในปีการศึกษา 2563', '', 'ตอบกลับ', 'แจ้งผู้มีรายชื่อทราบ', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวกับSAR', '2020-06-12'),
(420, 'คพ 36/63', '2020-03-23', 'ชุติกาญจน์ แก่นเพ็ชร', 'สุทินัน พรอนุรักษ์', 'แนวทางปฏิบัติสำหรับนักศึกษาออกฝึกประสบการณ์วิชาชีพ', '', 'ตอบกลับ', 'แจ้งเจ้าหน้าที่ประสานงานสหกิจ', '', 'ยังไม่เปืดอ่าน', 'ด่วน', 'เอกสารส่ง', 'ไม่เกี่ยวกับSAR', '2020-06-12'),
(422, 'ฝว. 24', '2020-03-14', 'งานทะเบียนวัดผล\r\n', 'สุทินัน พรอนุรักษ์', 'ขอส่งใบงานการปฏิบัติงาน', '', 'ตอบกลับ', '-', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปืดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวกับSAR', '2020-06-12'),
(423, 'วศ.51/63', '2020-04-02', ' ชุติกาญจน์ แก่นเพ็ชร', 'ทุกคน', 'มาตราการเฝ้าป้องกันระวังการระบาดของเชื้อไวรัวโคโรน่า', '', 'ไม่ตอบกลับ', '-', '', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'ไม่เกี่ยวกับSAR', '2020-06-12'),
(425, 'ฝว.31/2563', '2020-04-03', ' ชุติกาญจน์ แก่นเพ็ชร', 'ทุกคน', 'ขอจัดส่งข้อมูลเพื่อกาiประกันคุณภาพการศึกษาภายในประจำปีการศึกษา 2562', '', 'ล่าช้า', '-', 'ทดสอบแนบไฟล์.pdf', 'ยังไม่เปิดอ่าน', 'ปกติ', 'เอกสารส่ง', 'เกี่ยวกับSAR', '2020-06-12');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(5) NOT NULL,
  `email` varchar(50) NOT NULL,
  `password` varchar(20) NOT NULL,
  `f_name` varchar(100) NOT NULL,
  `l_name` varchar(100) NOT NULL,
  `position` varchar(50) NOT NULL,
  `phonenumber` varchar(10) NOT NULL,
  `userlevel` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `email`, `password`, `f_name`, `l_name`, `position`, `phonenumber`, `userlevel`) VALUES
(1, 'sarabantest1@gmail.com', '123456', 'ชุติกาญจน์', 'แก่นเพ็ชร', 'เจ้าพนักงานธุรการ ', '025493460', 'admin'),
(2, 'sarabantest2@gmail.com', '123456', 'มาโนช ', 'ประชา', 'หัวหน้าภาควิชาฯ ', '025493464', 'super user'),
(3, 'sarabantest3@gmail.com', '123456', 'สุทินัน', 'พรอนุรักษ์', 'อาจารย์', '025493464', 'user'),
(19, 'onepiecesess@gmail.com', '123456', 'นิวัฒน์ชัย', 'พูลสวัสดิ์', 'นักศึกษา', '0966394487', 'user');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `document`
--
ALTER TABLE `document`
  ADD PRIMARY KEY (`doc_id`);

--
-- Indexes for table `notification`
--
ALTER TABLE `notification`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `savedocument`
--
ALTER TABLE `savedocument`
  ADD PRIMARY KEY (`doc_id`);

--
-- Indexes for table `savesdocument`
--
ALTER TABLE `savesdocument`
  ADD PRIMARY KEY (`doc_id`);

--
-- Indexes for table `superdocument`
--
ALTER TABLE `superdocument`
  ADD PRIMARY KEY (`doc_id`);

--
-- Indexes for table `userdocument`
--
ALTER TABLE `userdocument`
  ADD PRIMARY KEY (`doc_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `document`
--
ALTER TABLE `document`
  MODIFY `doc_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=434;

--
-- AUTO_INCREMENT for table `notification`
--
ALTER TABLE `notification`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=174;

--
-- AUTO_INCREMENT for table `savedocument`
--
ALTER TABLE `savedocument`
  MODIFY `doc_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `savesdocument`
--
ALTER TABLE `savesdocument`
  MODIFY `doc_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT for table `superdocument`
--
ALTER TABLE `superdocument`
  MODIFY `doc_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=429;

--
-- AUTO_INCREMENT for table `userdocument`
--
ALTER TABLE `userdocument`
  MODIFY `doc_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=426;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
